<?php
// Задачи на приемы работы с логическими значениями

// 1.   Сделайте функцию, которая параметрами принимает 2 числа.
//      Если эти числа равны - пусть функция вернет true, а если не равны - false.

//function comparison($a, $b)
//{
//    if ($a == $b)
//    {
//        return true;
//    }
//    else
//    {
//        return false;
//    }
//}
//
//$k = comparison(2, 2);
//
//echo $k;

// 2.   Сделайте функцию, которая параметрами принимает 2 числа.
//      Если их сумма больше 10 - пусть функция вернет true, а если нет - false.


//$k = function($a, $b)
//{
//    return ($a + $b > 10);
//};
//
//echo $k(12, 3);

// 3.   Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет.
//      Если отрицательное - пусть функция вернет true, а если нет - false.


//$k = function ($a)
//{
//    if ($a < 0)
//        return true;
//};
//
//echo $k(-1);