<?php
// Задачи на приемы работы с циклами на PHP


// 1.   С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную $str.

//$str;
//for ($i = 1; $i < 10; $i++)
//{
//    $str .= $i;
//}
//
//echo $str;

// 2.   С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную $str.

//$str;
//
//for ($i = 9; $i > 0; $i--)
//{
//    $str .= $i;
//}
//
//echo $str;

// 3.   С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную $str.


//$str;
//
//for ($i = 1; $i < 10; $i++)
//{
//    $str .='-' . $i;
//}
//
//echo $str;


// 4.   Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:


//$str = '';
//for ($i = 0; $i <= 5; $i++)
//{
//    $str .= 'x';
//    echo $str . '<br>';
//}
//


// 5.   С помощью двух вложенных циклов нарисуйте следующую пирамидку:
//
//1
//22
//333
//4444
//55555
//666666
//7777777
//88888888
//999999999

//for ($i = 0; $i< 10; $i++){
//    for ($j = 0; $j < $i; $j++){
//        echo $i;
//    }
//    echo '<br>';
//}